lvx/base/InformationRegisters/бит_ДатыЗапретаРедактирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ДатыЗапретаРедактирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыОбъектовСистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Catalogs/бит_ГруппыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ГруппыОбъектовСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСистемы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/CommonModules/бит_ДатыЗапретаРедактирования/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура управляет доступностью формы в зависимости от установленных дат запрета редактирования.
// 
// Параметры:
//  ТекущаяФорма  - УправляемаяФорма - форма объекта
//  ТекущийОбъект - ДанныеФормыСтруктура - основной реквизит формы.
// 
Процедура УстановитьДоступностьФормыОбъекта(ТекущаяФорма, ТекущийОбъект) Экспорт
	
	МетаОбъект = ТекущийОбъект.Ссылка.Метаданные();
	
	Если ПропуститьПроверкуДатыЗапрета(МетаОбъект, ТекущаяФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ЗапретРедактирования = ВыполнитьПроверкуДатыЗапретаРедактирования(МетаОбъект, ТекущийОбъект);
	
	ТекущаяФорма.ТолькоПросмотр = ЗапретРедактирования;
	
КонецПроцедуры

// Выполняет проверку даты запрета редактирования.
// 
// Параметры:
// 	МетаДокОбъект - ОбъектМетаданных: Документ - метаданные документа по которому производится проверка.
// 	ДокОбъект - ДокументОбъект, ДанныеФормыСтруктура - документ.
// 	РежимСообщений - Строка - выводить или нет сообщения об ошибках.
// 
// Возвращаемое значение:
// 	Отказ - булево - Истина - документ попадает в закрытый период, его редактирование запрещено.
// 
Функция ВыполнитьПроверкуДатыЗапретаРедактирования(МетаДокОбъект, ДокОбъект, РежимСообщений = "Ошибки") Экспорт 
	
	// Флаг отказа редактирования документа в текущем периоде.
	Отказ = Ложь;
	
	ВыводитьОшибки = РежимСообщений = "Все" ИЛИ РежимСообщений = "Ошибки";
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Если НЕ ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Отказ = Истина;		
		Если ВыводитьОшибки Тогда
			ТекстСообщения = НСтр("ru='Текущий пользователь не авторизован.';en='Current user is not authorized.'");
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		КонецЕсли; 
	КонецЕсли;
	
	ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаДокОбъект);
	
	Если НЕ ЗначениеЗаполнено(ОбъектСистемы) Тогда
		Отказ = Истина;		
		Если ВыводитьОшибки Тогда
			ТекстСообщения = НСтр("ru='Не найден объект системы, соответствующий текущему документу. Обновите объекты системы в справочнике ""Объекты системы""';
								  |en='System object corresponding to the current document is not found. Update the system objects in the directory ""System objects""'");
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		КонецЕсли; 
	КонецЕсли;
	
	Если Отказ Тогда
		Если ВыводитьОшибки Тогда
			ТекстСообщения = НСтр("ru='Невозможно выполнить проверку даты запрета редактирования.';
								  |en='Unable to validate the date of the prohibition of editing.'");
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		КонецЕсли;
		
		Возврат Отказ;
	КонецЕсли;	
	
	// Получим данные документа для проверки
	ДанныеДокумента = ДанныеРеквизитовПоДокументу(МетаДокОбъект, ДокОбъект, ОбъектСистемы);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Данные"		   , ДанныеДокумента);
	Запрос.УстановитьПараметр("Пользователь"   , ТекущийПользователь);
	Запрос.УстановитьПараметр("ОбъектСистемы"  , ОбъектСистемы);
	Запрос.УстановитьПараметр("ВсеПользователи", Справочники.ГруппыПользователей.ВсеПользователи);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Данные.Организация,
	|	Данные.Дата,
	|	Данные.КлючСтроки
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	&Данные КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_ДатыЗапретаРедактирования.Организация,
	|	бит_ДатыЗапретаРедактирования.Пользователь,
	|	бит_ДатыЗапретаРедактирования.ОбъектСистемы,
	|	бит_ДатыЗапретаРедактирования.ДатаЗапрета,
	|	ВЫБОР
	|		КОГДА бит_ДатыЗапретаРедактирования.Организация В (Данные.Организация)
	|			ТОГДА 9
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА бит_ДатыЗапретаРедактирования.Пользователь = &Пользователь
	|			ТОГДА 99
	|		КОГДА ТИПЗНАЧЕНИЯ(бит_ДатыЗапретаРедактирования.Пользователь) = ТИП(Справочник.ГруппыПользователей)
	|			ТОГДА 11
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА бит_ДатыЗапретаРедактирования.ОбъектСистемы = &ОбъектСистемы
	|			ТОГДА 999
	|		КОГДА ТИПЗНАЧЕНИЯ(бит_ДатыЗапретаРедактирования.ОбъектСистемы) = ТИП(Справочник.бит_ГруппыОбъектовСистемы)
	|			ТОГДА 100
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет,
	|	Данные.КлючСтроки,
	|	Данные.Дата
	|ПОМЕСТИТЬ ДатыЗапрета
	|ИЗ
	|	Данные КАК Данные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ДатыЗапретаРедактирования КАК бит_ДатыЗапретаРедактирования
	|		ПО (бит_ДатыЗапретаРедактирования.Организация В (Данные.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)))
	|ГДЕ
	|	бит_ДатыЗапретаРедактирования.Пользователь В
	// Изменение кода. Начало. 03.06.2013{{
	|"
		+ ?(Метаданные.РегистрыСведений.Найти("СоставыГруппПользователей") <> Неопределено, "
		|			(ВЫБРАТЬ СоставыГруппПользователей.ГруппаПользователей КАК Пользователь
		|			 ИЗ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
		|			 ГДЕ СоставыГруппПользователей.Пользователь = &Пользователь
		|", "
		|			(ВЫБРАТЬ СоставыГруппПользователей.Ссылка КАК Пользователь
		|			 ИЗ Справочник.ГруппыПользователей.ПользователиГруппы КАК СоставыГруппПользователей
		|			 ГДЕ СоставыГруппПользователей.Пользователь = &Пользователь
		|
		// Дата запрета редактирования для группы ВсеПользователи.
		|			ОБЪЕДИНИТЬ ВСЕ		
		|			ВЫБРАТЬ
		|				&ВсеПользователи
		|
		|			ОБЪЕДИНИТЬ ВСЕ		
		|			ВЫБРАТЬ
		|				&Пользователь
		|")
	+ "
	// Изменение кода. Конец. 03.06.2013}}
	|		
	|			ОБЪЕДИНИТЬ ВСЕ		
	|			ВЫБРАТЬ
	|				НЕОПРЕДЕЛЕНО
	|		
	|			ОБЪЕДИНИТЬ ВСЕ		
	|			ВЫБРАТЬ
	|				ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|		
	|			ОБЪЕДИНИТЬ ВСЕ		
	|			ВЫБРАТЬ
	|				ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ПустаяСсылка))
	|	И бит_ДатыЗапретаРедактирования.ОбъектСистемы В
	|			(ВЫБРАТЬ
	|				бит_ГруппыОбъектовСистемыОбъектыСистемы.Ссылка КАК ОбъектСистемы
	|			ИЗ
	|				Справочник.бит_ГруппыОбъектовСистемы.ОбъектыСистемы КАК бит_ГруппыОбъектовСистемыОбъектыСистемы
	|			ГДЕ
	|				бит_ГруппыОбъектовСистемыОбъектыСистемы.ОбъектСистемы = &ОбъектСистемы
	|			СГРУППИРОВАТЬ ПО
	|						бит_ГруппыОбъектовСистемыОбъектыСистемы.Ссылка
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				НЕОПРЕДЕЛЕНО
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				&ОбъектСистемы
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				ЗНАЧЕНИЕ(Справочник.бит_ОбъектыСистемы.ПустаяСсылка)
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				ЗНАЧЕНИЕ(Справочник.бит_ГруппыОбъектовСистемы.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыЗапрета.КлючСтроки,
	|	МАКСИМУМ(ДатыЗапрета.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ МаксимальныеПриоритеты
	|ИЗ
	|	ДатыЗапрета КАК ДатыЗапрета
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатыЗапрета.КлючСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ДатыЗапрета.ДатаЗапрета) КАК ДатаЗапрета,
	|	МаксимальныеПриоритеты.КлючСтроки,
	|	МаксимальныеПриоритеты.Приоритет
	|ПОМЕСТИТЬ МинимальныеДатыЗапрета
	|ИЗ
	|	МаксимальныеПриоритеты КАК МаксимальныеПриоритеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыЗапрета КАК ДатыЗапрета
	|		ПО МаксимальныеПриоритеты.КлючСтроки = ДатыЗапрета.КлючСтроки
	|			И МаксимальныеПриоритеты.Приоритет = ДатыЗапрета.Приоритет
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныеПриоритеты.КлючСтроки,
	|	МаксимальныеПриоритеты.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальныеДатыЗапрета.КлючСтроки,
	|	ДатыЗапрета.Организация,
	|	ДатыЗапрета.Пользователь,
	|	ДатыЗапрета.ОбъектСистемы,
	|	МинимальныеДатыЗапрета.ДатаЗапрета,
	|	МинимальныеДатыЗапрета.Приоритет,
	|	ДатыЗапрета.Дата
	|ИЗ
	|	МинимальныеДатыЗапрета КАК МинимальныеДатыЗапрета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыЗапрета КАК ДатыЗапрета
	|		ПО МинимальныеДатыЗапрета.КлючСтроки = ДатыЗапрета.КлючСтроки
	|			И МинимальныеДатыЗапрета.Приоритет = ДатыЗапрета.Приоритет
	|			И МинимальныеДатыЗапрета.ДатаЗапрета = ДатыЗапрета.ДатаЗапрета";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
		Если Выборка.Дата <= КонецДня(Выборка.ДатаЗапрета) Тогда
			
			Отказ = Истина;
			
			Если ЗначениеЗаполнено(Выборка.Организация) Тогда
				ТекстОрганизация = НСтр("ru='по организации ""%1""';en='in organization ""%1""'");
				ТекстОрганизация = СтрШаблон(ТекстОрганизация,Выборка.Организация);
			Иначе
				ТекстОрганизация = НСтр("ru='по всем организациям';en='by all organizations'");
			КонецЕсли;
			
			Если ТипЗнч(Выборка.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
				ТекстПользователь = НСтр("ru='для пользователя ""%1""';en='for the user ""%1""'");
			Иначе
				ТекстПользователь = НСтр("ru='для группы пользователей ""%1""';en='for group of users ""%1""'");
			КонецЕсли;
			ТекстПользователь = СтрШаблон(ТекстПользователь,Выборка.Пользователь);
			
			Если НЕ ЗначениеЗаполнено(Выборка.ОбъектСистемы) Тогда
				ТекстОбъектСистемы = НСтр("ru='на все документы';en='for all documents'");
			ИначеЕсли ЗначениеЗаполнено(Выборка.ОбъектСистемы)
				И ТипЗнч(Выборка.ОбъектСистемы) = Тип("СправочникСсылка.бит_ГруппыОбъектовСистемы") Тогда	
				ТекстОбъектСистемы = НСтр("ru='на группу объектов ""%1""';en='for a group of objects ""%1""'");
				ТекстОбъектСистемы = СтрШаблон(ТекстОбъектСистемы,Выборка.ОбъектСистемы);
			Иначе
				ТекстОбъектСистемы = НСтр("ru='на документы ""%1""';en='for the documents ""%1""'");
				ТекстОбъектСистемы = СтрШаблон(ТекстОбъектСистемы,Выборка.ОбъектСистемы);
			КонецЕсли;
			
			ТекстСообщения = НСтр("ru='Редактирование данных этого периода запрещено: Запрет установлен %1 %2 %3 по %4 (включительно)';
								  |en='Editing data of this period is prohibited: Prohibition set on %1 %2 %3 until %4 (inclusive)'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстОбъектСистемы, ТекстОрганизация, ТекстПользователь, 
				Формат(Выборка.ДатаЗапрета, "ДЛФ=D"));
																						
			Если ВыводитьОшибки Тогда
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

// Функция определяет необходимость выполнения проверки даты запрета редактирования.
// 
// Параметры:
// 	МетаИсточник - ОбъектМетаданных: Документ - метаданные документа по которому производится проверка.
// 	Источник - УправляемаяФорма, ДокументОбъект - объект- инициатор проверки.
// 	РежимЗаписи - Неопределено, РежимЗаписиДокумента.
// 
// Возвращаемое значение:
// 	ПропуститьПроверку - булево.
// 
Функция ПропуститьПроверкуДатыЗапрета(МетаОбъект, Источник, РежимЗаписи=Неопределено) Экспорт 
	
	ПропуститьПроверку = Ложь;
	
	// Проверке подлежат только документы
	Если НЕ бит_РаботаСМетаданными.ОбъектПринадлежитКоллекцииМетаданных("Документы", МетаОбъект.Имя) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Наличие записей в регистре включает механизм даты запрета редактирования.
	Если НЕ НастройкаЗапретаРедактированияВыполнена() Тогда
		ПропуститьПроверку = Истина;
	КонецЕсли;
	
	// Документ не является регистратором каких-либо регистров.
	Если МетаОбъект.Движения.Количество() = 0
		И МетаОбъект.Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить Тогда
		
		ПропуститьПроверку = Истина;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("УправляемаяФорма") Тогда
		
		// Лазейка для программного изменения документов.
		Если Источник.Параметры.Свойство("бит_НеПроверятьДатыЗапретаРедактирования") Тогда
			ПропуститьПроверку = Истина;
		КонецЕсли;
		
		// Открылась форма нового документа
		Если Источник.Параметры.Ключ.Пустая() Тогда
			ПропуститьПроверку = Истина;
		КонецЕсли;
		
		// Документ не проведен
		Если МетаОбъект.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить
			И НЕ Источник.Параметры.Ключ.Проведен Тогда
			
			ПропуститьПроверку = Истина;
		КонецЕсли;
		
	Иначе	
		
		// При обмене данными не выполняем проверку
		Если Источник.ОбменДанными.Загрузка Тогда
			ПропуститьПроверку = Истина;
		КонецЕсли;
		
		// Лазейка для программного изменения документов.
		Если Источник.ДополнительныеСвойства.Свойство("бит_НеПроверятьДатыЗапретаРедактирования") Тогда
			ПропуститьПроверку = Истина;
		КонецЕсли;
		
		// Не позволяем выполнять запись проведенного документа без перепроведения.
		Если МетаОбъект.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить
			И РежимЗаписи = РежимЗаписиДокумента.Запись
			И НЕ Источник.Проведен Тогда
			
			ПропуститьПроверку = Истина;
		КонецЕсли;
		
	КонецЕсли;

	Возврат ПропуститьПроверку;
	
КонецФункции

// Процедура - обработчик подписки "бит_ДатаЗапретаРедактированияПередЗаписьюДокумента".
// 
Процедура бит_ДатаЗапретаРедактированияПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Если бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_ЭтоЧужойПодчиненныйУзел") = Истина Тогда
		Возврат;
	КонецЕсли; 			
	
	ПроверитьДатыЗапретаРедактированияПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Инициирует проверку даты запрета перед записью документа, вызывается из подписки на событие.
// 
// Параметры:
// 	Источник - ДокументОбъект
// 	Отказ - булево
// 	РежимЗаписи - РежимЗаписиДокумента
// 	РежимПроведения.
// 
Процедура ПроверитьДатыЗапретаРедактированияПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИсточникМета = Источник.Метаданные();
	
	Если ПропуститьПроверкуДатыЗапрета(ИсточникМета, Источник, РежимЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыполнитьПроверкуДатыЗапретаРедактирования(ИсточникМета, Источник) Тогда
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

// Функция проверяет наличие записей в регистре бит_ДатыЗапретаРедактирования.
// 
// Параметры:
// 	нет
// 
// Возвращаемое значение:
// 	НастройкаВыполнена - булево - Истина - регистр заполнен.
// 
Функция НастройкаЗапретаРедактированияВыполнена()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_ДатыЗапретаРедактирования.ДатаЗапрета
	|ИЗ
	|	РегистрСведений.бит_ДатыЗапретаРедактирования КАК бит_ДатыЗапретаРедактирования";
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		НастройкаВыполнена = Ложь;
	Иначе
		НастройкаВыполнена = Истина;
	КонецЕсли;
	
	Возврат НастройкаВыполнена;
	
КонецФункции

// Получает таблицу значений реквизитов объекта, влияющих на проверку.
// 
// Параметры:
// 	МетаИсточник - ОбъектМетаданных: Документ - метаданные документа по которому производится проверка.
// 	Источник - ДокументОбъект, ДанныеФормыСтруктура - документ.
// 	ОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы.
// 
// Возвращаемое значение:
// 	Данные - ТаблицаЗначений.
// 	
Функция ДанныеРеквизитовПоДокументу(МетаИсточник, Источник, ОбъектСистемы)
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("КлючСтроки"	, Новый ОписаниеТипов("Число"));
	Данные.Колонки.Добавить("Дата"			, Новый ОписаниеТипов("Дата"));
	Данные.Колонки.Добавить("Организация"	, Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	ИмяРеквизитаДата = ПолучитьИмяРеквизитаДатаДокумента(ОбъектСистемы.ИмяОбъектаПолное);
	ЕстьОрганизация = бит_РаботаСМетаданными.ЕстьРеквизит("Организация", МетаИсточник);
	
	ЗаписываемыеДокументы = Новый Соответствие;
	ЗаписываемыеДокументы.Вставить("ОперацияБух", Истина);
	ЗаписываемыеДокументы.Вставить("бит_ОперацияБюджетирование",Истина);
	ЗаписываемыеДокументы.Вставить("бит_ОперацияУправленческий", Истина);
	
	// Параметры документа до изменения
	Если ЗначениеЗаполнено(Источник.Ссылка) И (Источник.Ссылка.Проведен ИЛИ ЗаписываемыеДокументы[МетаИсточник.Имя] = Истина) Тогда 
		// Если документ не проведен, нет смысла проверять предыдущие значения реквизитов.		
		НоваяСтрока = Данные.Добавить();
		НоваяСтрока.Дата = Источник.Ссылка[ИмяРеквизитаДата];
		Если ЕстьОрганизация Тогда
			НоваяСтрока.Организация = Источник.Ссылка.Организация;
		КонецЕсли;		
	КонецЕсли;
	
	// Параметры документа после изменения
	НоваяСтрока = Данные.Добавить();
	НоваяСтрока.Дата = Источник[ИмяРеквизитаДата];
	Если ЕстьОрганизация Тогда
		НоваяСтрока.Организация = Источник.Организация;
	КонецЕсли;
	
	Данные.Свернуть("КлючСтроки,Дата,Организация");	
	Для ном = 0 По Данные.Количество()-1 Цикл
		Данные[Ном].КлючСтроки = Ном;
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

// Функция получает имя реквизита в котором содержится дата документа.
// 
// Параметры:
// 	ИмяОбъекта - Строка - полное имя объекта из справочника бит_ОбъектыСистемы.
// 
// Возвращаемое значение:
// 	ИмяРеквизита - Строка.
// 
Функция ПолучитьИмяРеквизитаДатаДокумента(ИмяОбъекта)
	
	СоответствиеИмен = Новый Соответствие;
	СоответствиеИмен.Вставить("Документ.бит_ЗаявкаНаРасходованиеСредствОбщая"		, "ДатаРасхода");
	СоответствиеИмен.Вставить("Документ.бит_ЗаявкаНаРасходованиеСредств"			, "ДатаРасхода");
	СоответствиеИмен.Вставить("Документ.бит_ПлатежнаяПозиция"						, "ДатаРасхода");
	СоответствиеИмен.Вставить("Документ.бит_ЗаявкаНаЗатраты"						, "ДатаРасхода");
	СоответствиеИмен.Вставить("Документ.бит_РасходнаяПозиция"						, "ДатаРасхода");
	СоответствиеИмен.Вставить("Документ.бит_ПланируемоеПоступлениеДенежныхСредств"	, "ДатаПоступления");
	
	ИмяРеквизита = СоответствиеИмен[ИмяОбъекта];
	
	Если ИмяРеквизита = Неопределено Тогда
		ИмяРеквизита = "Дата";
	КонецЕсли;
	
	Возврат ИмяРеквизита;
	
КонецФункции

#КонецОбласти
